Table of Contents
 Class TendonBar
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Tendon bar
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.TendonBar,CI.ReinforcedSection")]
public class TendonBar : OpenObject
Inheritance
object
OpenObject
TendonBar
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Id
Tendon Id
public int Id { get; set; }
Property Value
int
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 NumStrandsInTendon
number of ropes in tendon
public int NumStrandsInTendon { get; set; }
Property Value
int
 Phase
Phase
public int Phase { get; set; }
Property Value
int
 Point
Position of bar
[OpenModelProperty("CentrePoint")]
public Point2D Point { get; set; }
Property Value
Point2D
 PrestressReinforcementType
set of prestress reinforcement type
public FatigueTypeOfPrestressingSteel PrestressReinforcementType { get; set; }
Property Value
FatigueTypeOfPrestressingSteel
 PrestressingOrder
order of tendon prestessing
public int PrestressingOrder { get; set; }
Property Value
int
 TendonDuct
Tendon duct
public TendonDuct TendonDuct { get; set; }
Property Value
TendonDuct
 TendonType
Tendon type
public TendonBarType TendonType { get; set; }
Property Value
TendonBarType
 Edit this page